ГТС/УТГТС/Enums/ТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Импорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВвозИзЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СДавальцем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СДавальцем2_5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПереработчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоклажедателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СХранителем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентомНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПереработчиком2_5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияЧерезКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПереработчиком2_5_ЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВАренду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субаренда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицоНеРезидент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/CommonModules/ДоговорыКонтрагентовЛокализацияКлиентСервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс
//++ Локализация

Функция ИменаРеквизитовГОЗ() Экспорт
	СтруктураРеквизитов = "ВариантПлатежаГОЗ, ВыполненыОбязательстваПоДоговоруГОЗ, ГосударственныйКонтракт, Дата, Номер, 
		|Сумма, ДоговорСУчастникомГОЗ, ДоговорСсылка, КонтрагентЮрФизЛицо, КонтрактСЗаказчиком, 
		|ОплатаРасходовПоТарифамСГосрегулированием, ПлатежиПо275ФЗ, ПоддержкаПлатежей275ФЗ, ТипДоговора, ТипПлатежаФЗ275,
		|Организация, ОрганизацияПолучатель, СуммаТраншей, ХарактерДоговора, АдресПодтверждающихДокументовВоВременномХранилище";
	Возврат СтруктураРеквизитов
КонецФункции

// Параметры:
// 	Форма - ФормаКлиентскогоПриложения
//
Процедура УправлениеНастройкойГОЗ(Форма) Экспорт
	Форма.ВариантПлатежаГОЗ = ИнициализироватьВариантПлатежаГОЗ(Форма.Объект.ПлатежиПо275ФЗ,
		Форма.Объект.ДоговорСУчастникомГОЗ,
		Форма.Объект.ОплатаРасходовПоТарифамСГосрегулированием);
	Объект = Форма.Объект;
	
	СЗаказчиком =
		Объект.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПокупателем")
		Или Ложь;
	
	СИсполнителем =
		Объект.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПереработчиком2_5")
		Или Объект.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПереработчиком2_5_ЕАЭС")
		//++ Устарело_Переработка24
		Или Объект.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПереработчиком")
		//-- Устарело_Переработка24
		Или (Объект.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПоставщиком")
		И Не Объект.ДоговорССамозанятым);
		
	ПоддержкаПлатежей275ФЗ = Форма.ПоддержкаПлатежей275ФЗ;
	ПоддержкаЭлектронногоАктированияВЕИС = Форма.ПоддержкаЭлектронногоАктированияВЕИС;
	
	Форма.Элементы.ИдентификаторГосКонтракта.Видимость = НЕ Форма.ПоддержкаПлатежей275ФЗ
		И СЗаказчиком;
			
	Форма.Элементы.ИностранныйИсполнительВУтвержденномПеречнеГОЗ.Видимость =
		(СИсполнителем
			И Форма.Объект.ДоговорСУчастникомГОЗ
			И Форма.КонтрагентЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицоНеРезидент"));
	
	Форма.Элементы.ЛокализацияГруппаНастроитьГОЗ.Видимость = (ПоддержкаПлатежей275ФЗ И (СЗаказчиком Или СИсполнителем))
		Или (ПоддержкаЭлектронногоАктированияВЕИС И СЗаказчиком);
	
	Если ЗначениеЗаполнено(Форма.Объект.ГосударственныйКонтракт) Тогда
		Форма.Элементы.ДекорацияНастроитьГК.Заголовок = Новый ФорматированнаяСтрока(Форма.Объект.ГосударственныйКонтракт.Наименование,,,, "НастроитьГОЗ");
	Иначе
		Форма.Элементы.ДекорацияНастроитьГК.Заголовок = Новый ФорматированнаяСтрока(НСтр("ru='Настроить договор для исполнения госконтракта'"),,,, "НастроитьГОЗ");
	КонецЕсли;	
КонецПроцедуры

Функция ИнициализироватьВариантПлатежаГОЗ(ПлатежиПо275ФЗ, ДоговорСУчастникомГОЗ, ОплатаРасходовПоТарифамСГосрегулированием) Экспорт
	ВариантПлатежаГОЗ = 0;
	Если ПлатежиПо275ФЗ И ДоговорСУчастникомГОЗ Тогда
		ВариантПлатежаГОЗ = 1;
	ИначеЕсли ОплатаРасходовПоТарифамСГосрегулированием Тогда
		ВариантПлатежаГОЗ = 2;
	КонецЕсли;
	Возврат ВариантПлатежаГОЗ
КонецФункции

//-- Локализация

#КонецОбласти
